cf/InformationRegisters/СобытияВСистеме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СобытияВСистеме</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияСистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Форма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязаннаяСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГуидСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/СобытияСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СобытияСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регистрировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/Слежение/Ext/Module.bsl
Функция СоздатьИПолучитьНовоеСобытие(стрСобытие)
	
	НовСобытие = Справочники.СобытияСистемы.СоздатьЭлемент();
	НовСобытие.Представление 	= стрСобытие;
	НовСобытие.Регистрировать 	= Истина;
	
	Если ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(НовСобытие) Тогда
	
		// Добавим в параметр сеанса
		
		НовСостояния = Новый Структура;
		Для Каждого Элемент Из ПараметрыСеанса.СобытияСистемы Цикл НовСостояния.Вставить(Элемент.Ключ, Элемент.Значение) КонецЦикла;
		НовСостояния.Вставить(стрСобытие, НовСобытие.Ссылка);
		ПараметрыСеанса.СобытияСистемы = Новый ФиксированнаяСтруктура(НовСостояния); КонецЕсли;
	
	// Вернем что есть
	
	Возврат НовСобытие.Ссылка;
	
КонецФункции

Функция ПолучитьСобытиеСистемы(стрСобытие)
	
	МаскСтрСобытие = Справочники.СобытияСистемы.МаскироватьСобытие(стрСобытие);
	
	Возврат ?(ПараметрыСеанса.СобытияСистемы.Свойство(МаскСтрСобытие), 
					ПараметрыСеанса.СобытияСистемы[МаскСтрСобытие], 
					СоздатьИПолучитьНовоеСобытие(МаскСтрСобытие));
	
КонецФункции

Функция Записать(стрСобытие = "", ОбъектСобытия = "", Форма = "", СвязаннаяСсылка = Неопределено, Комментарий = "") Экспорт
	
	Событие = ПолучитьСобытиеСистемы(стрСобытие);
	Если Событие.Регистрировать Тогда
	
		НовЗапись = РегистрыСведений.СобытияВСистеме.СоздатьМенеджерЗаписи();
		НовЗапись.ДатаСобытия		= ТекущаяДата();
		НовЗапись.ГуидСобытия 		= Строка(Новый УникальныйИдентификатор);
		НовЗапись.Пользователь 		= ПараметрыСеанса.ТекущийПользователь;
		НовЗапись.Событие 			= ПолучитьСобытиеСистемы(стрСобытие);
		НовЗапись.ОбъектСобытия 	= ОбъектСобытия;
		НовЗапись.Форма 			= Форма;
		НовЗапись.СвязаннаяСсылка 	= СвязаннаяСсылка;
		НовЗапись.Комментарий 		= Комментарий;
		
		Возврат ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(НовЗапись);
		
	Иначе Возврат Истина; КонецЕсли;
	
КонецФункции
